{
  "className": "MedicationAdministrationPerformer",
  "type": "OBJECT",
  "descr": "\"Describes the event of a patient consuming or otherwise being administered a medication.  This may be as simple as swallowing a tablet or it may be a long running infusion.  Related resources tie this event to the authorizing prescription, and the specific encounter between patient and health care practitioner.\"",
  "isInnerClass": true,
  "fields": [
    {
      "name": "actor",
      "descr": "\"The device, practitioner, etc. who performed the action.\"",
      "typeName": "Reference",
      "isArray": false,
      "isRequired": true,
      "size": 1024,
      "isTransient": false,
      "type": "OBJECT"
    },
    {
      "name": "onBehalfOf",
      "descr": "\"The organization the device or practitioner was acting on behalf of.\"",
      "typeName": "Reference",
      "isArray": false,
      "isRequired": false,
      "size": 1024,
      "isTransient": false,
      "type": "OBJECT"
    },
    {
      "name": "modifierExtension",
      "descr": "\"May be used to represent additional information that is not part of the basic definition of the element, and that modifies the understanding of the element that contains it. Usually modifier elements provide negation or qualification. In order to make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.\"\n derived from BackboneElement",
      "typeName": "Extension",
      "isArray": true,
      "isRequired": false,
      "size": 1024,
      "isTransient": false,
      "type": "COMPLEX"
    },
    {
      "name": "id",
      "descr": "\"unique id for the element within a resource (for internal references). This may be any string value that does not contain spaces.\"\n derived from Element\n derived from BackboneElement",
      "typeName": "string",
      "isArray": false,
      "isRequired": false,
      "size": 1024,
      "isTransient": false,
      "type": "PRIMITIVE"
    },
    {
      "name": "_id",
      "descr": "\"Extensions for id\"\n derived from Element\n derived from BackboneElement",
      "typeName": "Element",
      "isArray": false,
      "isRequired": false,
      "size": 1024,
      "isTransient": true,
      "type": "COMPLEX"
    },
    {
      "name": "extension",
      "descr": "\"May be used to represent additional information that is not part of the basic definition of the element. In order to make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.\"\n derived from Element\n derived from BackboneElement",
      "typeName": "Extension",
      "isArray": true,
      "isRequired": false,
      "size": 1024,
      "isTransient": false,
      "type": "COMPLEX"
    }
  ]
}