{
  "className": "ObservationReferenceRange",
  "type": "OBJECT",
  "descr": "\"Measurements and simple assertions made about a patient, device or other subject.\"",
  "isInnerClass": true,
  "fields": [
    {
      "name": "low",
      "descr": "\"The value of the low bound of the reference range.  The low bound of the reference range endpoint is inclusive of the value (e.g.  reference range is \u003e\u003d5 - \u003c\u003d9).   If the low bound is omitted,  it is assumed to be meaningless (e.g. reference range is \u003c\u003d2.3).\"",
      "typeName": "Quantity",
      "isArray": false,
      "isRequired": false,
      "size": 1024,
      "isTransient": false,
      "type": "COMPLEX"
    },
    {
      "name": "high",
      "descr": "\"The value of the high bound of the reference range.  The high bound of the reference range endpoint is inclusive of the value (e.g.  reference range is \u003e\u003d5 - \u003c\u003d9).   If the high bound is omitted,  it is assumed to be meaningless (e.g. reference range is \u003e\u003d 2.3).\"",
      "typeName": "Quantity",
      "isArray": false,
      "isRequired": false,
      "size": 1024,
      "isTransient": false,
      "type": "COMPLEX"
    },
    {
      "name": "type",
      "descr": "\"Codes to indicate the what part of the targeted reference population it applies to. For example, the normal or therapeutic range.\"",
      "typeName": "CodeableConcept",
      "isArray": false,
      "isRequired": false,
      "size": 1024,
      "isTransient": false,
      "type": "COMPLEX"
    },
    {
      "name": "appliesTo",
      "descr": "\"Codes to indicate the target population this reference range applies to.  For example, a reference range may be based on the normal population or a particular sex or race.\"",
      "typeName": "CodeableConcept",
      "isArray": true,
      "isRequired": false,
      "size": 1024,
      "isTransient": false,
      "type": "COMPLEX"
    },
    {
      "name": "age",
      "descr": "\"The age at which this reference range is applicable. This is a neonatal age (e.g. number of weeks at term) if the meaning says so.\"",
      "typeName": "Range",
      "isArray": false,
      "isRequired": false,
      "size": 1024,
      "isTransient": false,
      "type": "COMPLEX"
    },
    {
      "name": "text",
      "descr": "\"Text based reference range in an observation which may be used when a quantitative range is not appropriate for an observation.  An example would be a reference value of \\\"Negative\\\" or a list or table of \u0027normals\u0027.\"",
      "typeName": "string",
      "isArray": false,
      "isRequired": false,
      "size": 1024,
      "isTransient": false,
      "type": "PRIMITIVE"
    },
    {
      "name": "_text",
      "descr": "\"Extensions for text\"",
      "typeName": "Element",
      "isArray": false,
      "isRequired": false,
      "size": 1024,
      "isTransient": true,
      "type": "COMPLEX"
    },
    {
      "name": "modifierExtension",
      "descr": "\"May be used to represent additional information that is not part of the basic definition of the element, and that modifies the understanding of the element that contains it. Usually modifier elements provide negation or qualification. In order to make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.\"\n derived from BackboneElement",
      "typeName": "Extension",
      "isArray": true,
      "isRequired": false,
      "size": 1024,
      "isTransient": false,
      "type": "COMPLEX"
    },
    {
      "name": "id",
      "descr": "\"unique id for the element within a resource (for internal references). This may be any string value that does not contain spaces.\"\n derived from Element\n derived from BackboneElement",
      "typeName": "string",
      "isArray": false,
      "isRequired": false,
      "size": 1024,
      "isTransient": false,
      "type": "PRIMITIVE"
    },
    {
      "name": "_id",
      "descr": "\"Extensions for id\"\n derived from Element\n derived from BackboneElement",
      "typeName": "Element",
      "isArray": false,
      "isRequired": false,
      "size": 1024,
      "isTransient": true,
      "type": "COMPLEX"
    },
    {
      "name": "extension",
      "descr": "\"May be used to represent additional information that is not part of the basic definition of the element. In order to make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.\"\n derived from Element\n derived from BackboneElement",
      "typeName": "Extension",
      "isArray": true,
      "isRequired": false,
      "size": 1024,
      "isTransient": false,
      "type": "COMPLEX"
    }
  ]
}